In [1]:
import pandas as pd
student_marks={
    'student_name':['Aryan','Sahil','Muskan','Devanshu'],
    'Roll_No':[1001,1002,1003,1004],
    'Marks':[78,98,89,90]

}

pd.DataFrame(student_marks)

  student_name  Roll_No  Marks
0        Aryan     1001     78
1        Sahil     1002     98
2       Muskan     1003     89
3     Devanshu     1004     90

In [4]:
# custom index

pd.DataFrame(student_marks,index=student_marks['Roll_No'])

     student_name  Roll_No  Marks
1001        Aryan     1001     78
1002        Sahil     1002     98
1003       Muskan     1003     89
1004     Devanshu     1004     90

In [ ]:
## Convert CSV/Excel (or any file) into DataFram